%% Окно 1
x = linspace(-1.7, -1.5, 500);								%аргументы полинома
y2 = fun2(x);												%новая функция (далее - функция)
ff = y2;
ind = abs(ff) > 200000;										%ограничение значений оси ординат
ff(ind) = NaN;
plot(x, ff)													%построение функции
grid on
xlabel('x');												%подписи осей
ylabel('y');
title('Функция');											%подпись графика
hold on
line([-1.6, -1.6], [150000, -150000], 'color', 'r')			%построение асимптоты

%% Окно 2
%% Построение функции
figure
x1 = linspace(1, 4, 100);									%аргументы функции
Y1 = fun1(x1);												%значение функции
p1 = plot(x1, Y1, 'k');										%построение функции
grid on
xlabel('x');												%подписи осей
ylabel('y');
title('Кусочная функция');									%подпись графика
text(1.5, 800, 'root');										%подпись корня

%% Построение полинома
hold on
x2 = linspace(-1.32, 1, 100);								%аргументы полинома
Y = pol(x2);												%значение полинома
p2 = plot(x2, Y * 1000, 'm');								%построение полинома
text(-1.3, 800, 'root');									%подпись корня

%% Построение частного функции и полинома
hold on
x = linspace(-1.95, -1.32, 100);							%аргументы новой функции
y = pol(x);													%значение полинома
y1 = fun1(x);												%значение функции
y2 = fun2(x);												%новая функция
ff = y2;
ind = abs(ff) > 20000;										%ограничение значений оси ординат
ff(ind) = NaN;
p3 = plot(x, ff);											%построение функции
						
%% Построение асимптоты и корней
hold on
line([-1.6, -1.6], [18000, -18000], 'color', 'r')			%построение асимптоты
hold on
plot(1.5, 0, 'g.')											%корень новой функции
hold on
plot(-1.3, 0, 'r.')											%корень полинома
legend([p1, p2, p3], {'Функция', 'Полином', 'Частное'})		%легенда