%% Окно 1
%% Характеристический полином
matrix = [5.9507  1.3468 -1.7517  0.3284 -1.7145 -3.761  -4.2671 -0.1254 -1.8324 -3.2423
		 -2.4151 -0.0669  0.2975  1.2606  0.8317 -0.728   0.7213  2.0279  2.0937 -1.4506
		 -4.4816 -1.1502  9.0776  0.622  -0.4998 -3.0618 -1.5944  2.6214  2.2478  0.3083
		 -1.5108 -0.3819 -1.1529 -0.026   0.7621  0.9624 -0.5078  0.1086  2.2319  0.7678
		 -3.2314 -0.8235 -2.2375 -1.3416  5.5236 -0.5562 -1.5065  0.0295  0.9993  0.7226
		  1.092   0.3294 -1.0033  0.4390 -1.8597 10.2924 -4.6083 -9.3956 -2.3187  3.0877
		 -1.7932 -0.454  -1.3442 -0.7453 -1.7399 -1.3441 13.0325  0.5463  0.8250  0.8414
		 -0.8168 -0.2279  0.1156 -0.3336  0.3739 -4.2628  2.1442  5.0571  4.5388  2.1597
		 -0.0982 -0.0282  0.0411 -0.0399  0.0886 -0.6491  0.3831  0.7411 15.0656  2.5683
       	  0.3482  0.106  -0.3538  0.1397 -0.6473  3.3443 -2.3153 -4.141  -1.5785  0.9178];
p = poly(matrix);											%формирование полинома
x = -2 : 0.01 : 16;											%аргументы полинома
y = polyval(p, x);											%значение полинома
figure
plot(x, y)													%построение графика
grid on
zero = roots(p);
ind = zero(imag(zero) == 0);								%отбор действительных корней
r = ind;
hold on
plot(r, 0, 'ro')											%построение корней
title('Полином')											%подпись графика

%% Окно 2
%% Уточнение поведения функции
x1 = 11 : 0.01 : 12;
y1 = polyval(p, x1);										%значение полинома
figure
subplot(1, 2, 1)
plot(x1, y1);
grid on
hold on
plot(r(3), 0, 'ro')											%построение корней
hold on
plot(r(4), 0, 'ro')
title('Участок x = [11; 12]')
subplot(1, 2, 2)
x2 = 0.2 : 0.01 : 0.5;
y2 = polyval(p, x2);										%значение полинома
plot(x2, y2);
hold on
plot(r(6), 0, 'ro')											%построение корней
grid on
title('Участок x=[0.2;0.5]')

%% Производные
p1 = polyder(p);											%первая производная
p2 = polyder(p1);											%вторая производная
p3 = polyder(p2);											%третья производная
xp1 = roots(p1);
xx1 = xp1(imag(xp1) == 0);									%вещественные корни первой производной
xp2 = roots(p2);
xx2 = xp2(imag(xp2) == 0);									%вещественные корни второй производной
xp3 = roots(p3);
xx3 = xp3(imag(xp3) == 0);									%вещественные корни третьей производной

%% Окно 3
%% Графики полинома и производных
yy1 = polyval(p1, x);										%значения первой производной
yy2 = polyval(p2, x);										%значения второй производной
yy3 = polyval(p3, x);										%значения третьей производной
figure
subplot(4, 1, 1)
ind = abs(y) > 35000000;									%ограничение значений оси ординат
y(ind) = NaN;
plot(x, y)
grid on
hold on
plot(r, 0, 'ro')											%построение корней
title('Полином')											%подпись графика
xlabel('x')													%подписи осей
ylabel('y')
subplot(4, 1, 2)
ind = abs(yy1) > 35000000;									%ограничение значений оси ординат
yy1(ind) = NaN;
plot(x, yy1)
grid on
hold on
plot(xx1, 0, 'ro')											%построение корней
title('Первая производная')									%подпись графика
xlabel('x')													%подписи осей
ylabel('y')
subplot(4, 1, 3)
ind = abs(yy2) > 41000000;									%ограничение значений оси ординат
yy2(ind) = NaN;
plot(x, yy2)
grid on
hold on
plot(xx2, 0, 'ro')											%построение корней
title('Вторая производная')									%подпись графика
xlabel('x')													%подписи осей
ylabel('y')
subplot(4, 1, 4)
ind = abs(yy3) > 42000000;									%ограничение значений оси ординат
yy3(ind) = NaN;
plot(x, yy3)
grid on
hold on
plot(xx3, 0, 'ro')											%построение корней
title('Третья производная')									%подпись графика
xlabel('x')													%подписи осей
ylabel('y')

%% Экстремумы
Y = polyval(p, xx1);										%координаты экстремумов как корни производной
fun = @(x) polyval(p, x);
mfun = @(x) -polyval(p, x);
[X1(7), Y1(7)] = fminbnd(fun, 0.3, 0.4);
[X1(6), Y1(6)] = fminbnd(mfun, 0.6, 0.7);
Y1(6) = -Y1(6);
[X1(5), Y1(5)] = fminbnd(fun, 5, 7);
[X1(4), Y1(4)] = fminbnd(mfun, 9, 10);
Y1(4) = -Y1(4);
[X1(3), Y1(3)] = fminbnd(fun, 11, 12);
[X1(2), Y1(2)] = fminbnd(mfun, 13, 14);
Y1(2) = -Y1(2);
[X1(1), Y1(1)] = fminbnd(fun, 15, 16);
X1 = X1';
Y1 = Y1';
pogrx = abs(X1-xx1);
pogry = abs(Y1-Y);

%% Относительная погрешность
p(2) = p(2) + (p(2) * rand * 0.05);							% 5%
zero1 = roots(p);											%корни полинома с погрешностью
otn = max(abs((zero - zero1)./zero));						%относительная погрешность